Merge pull request #4 from shuanat/release/1.0.1
Merge release/1.0.1 into master
